YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/b_mcal_nxp_S32K3xx/b_mcal_Base_nxp_S32K3xx/header/S32M27x_MSCM.h
#define MSCM_IAHBCFGREG_HSE_DIS_WR_OPT_MASK      (0x8U)
#define MSCM_IAHBCFGREG_HSE_DIS_WR_OPT_SHIFT     (3U)
#define MSCM_IAHBCFGREG_HSE_DIS_WR_OPT_WIDTH     (1U)
#define MSCM_IAHBCFGREG_HSE_DIS_WR_OPT(x)        (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_HSE_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_HSE_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_TCM_DIS_WR_OPT_MASK      (0x10U)
#define MSCM_IAHBCFGREG_TCM_DIS_WR_OPT_SHIFT     (4U)
#define MSCM_IAHBCFGREG_TCM_DIS_WR_OPT_WIDTH     (1U)
#define MSCM_IAHBCFGREG_TCM_DIS_WR_OPT(x)        (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_TCM_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_TCM_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_CM7_0_AHBS_DIS_WR_OPT_MASK (0x40U)
#define MSCM_IAHBCFGREG_CM7_0_AHBS_DIS_WR_OPT_SHIFT (6U)
#define MSCM_IAHBCFGREG_CM7_0_AHBS_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_CM7_0_AHBS_DIS_WR_OPT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_CM7_0_AHBS_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_CM7_0_AHBS_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_AIPS0_DIS_WR_OPT_MASK    (0x800U)
#define MSCM_IAHBCFGREG_AIPS0_DIS_WR_OPT_SHIFT   (11U)
#define MSCM_IAHBCFGREG_AIPS0_DIS_WR_OPT_WIDTH   (1U)
#define MSCM_IAHBCFGREG_AIPS0_DIS_WR_OPT(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_AIPS0_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_AIPS0_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_PRAM0_DIS_WR_OPT_MASK    (0x2000U)
#define MSCM_IAHBCFGREG_PRAM0_DIS_WR_OPT_SHIFT   (13U)
#define MSCM_IAHBCFGREG_PRAM0_DIS_WR_OPT_WIDTH   (1U)
#define MSCM_IAHBCFGREG_PRAM0_DIS_WR_OPT(x)      (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_PRAM0_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_PRAM0_DIS_WR_OPT_MASK)

#define MSCM_IAHBCFGREG_TCM_PRAM_DIS_WR_OPT_MASK (0x8000U)
#define MSCM_IAHBCFGREG_TCM_PRAM_DIS_WR_OPT_SHIFT (15U)
#define MSCM_IAHBCFGREG_TCM_PRAM_DIS_WR_OPT_WIDTH (1U)
#define MSCM_IAHBCFGREG_TCM_PRAM_DIS_WR_OPT(x)   (((uint32_t)(((uint32_t)(x)) << MSCM_IAHBCFGREG_TCM_PRAM_DIS_WR_OPT_SHIFT)) & MSCM_IAHBCFGREG_TCM_PRAM_DIS_WR_OPT_MASK)
/*! @} */

/*! @name IRSPRC - Interrupt Router Shared Peripheral Routing Control */
/*! @{ */

#define MSCM_IRSPRC_M7_0_MASK                    (0x1U)
#define MSCM_IRSPRC_M7_0_SHIFT                   (0U)
#define MSCM_IRSPRC_M7_0_WIDTH                   (1U)
#define MSCM_IRSPRC_M7_0(x)                      (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_M7_0_SHIFT)) & MSCM_IRSPRC_M7_0_MASK)

#define MSCM_IRSPRC_LOCK_MASK                    (0x8000U)
#define MSCM_IRSPRC_LOCK_SHIFT                   (15U)
#define MSCM_IRSPRC_LOCK_WIDTH                   (1U)
#define MSCM_IRSPRC_LOCK(x)                      (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_LOCK_SHIFT)) & MSCM_IRSPRC_LOCK_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group MSCM_Register_Masks */

/*!
 * @}
 */ /* end of group MSCM_Peripheral_Access_Layer */

#endif  /* #if !defined(S32M27x_MSCM_H_) */
